Ran Plan for project: `Production` dir: `infra/terraform/environment/prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.main.google_compute_global_address.argo will be created
+ resource "google_compute_global_address" "argo" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "spino-argo-static-ip-prod"
      + prefix_length      = (known after apply)
      + project            = "spino-cup-2024"
      + self_link          = (known after apply)
      + terraform_labels   = (known after apply)
    }

  # module.main.google_dns_record_set.argo will be created
+ resource "google_dns_record_set" "argo" {
      + id           = (known after apply)
      + managed_zone = "spino-zone-prod"
      + name         = "argo.spino.kurichi.dev."
      + project      = "spino-cup-2024"
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # module.main.local_file.kubeconfig will be created
+ resource "local_file" "kubeconfig" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "spino-kubeconfig-prod"
      + id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p Production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=tosaken1116%252Fspino_cup_2024%252Finfra%252Fterraform%252Fenvironment%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p Production
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```